Revit 2024 API
XYZ.BasisY Property
The basis of the Y axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static XYZ BasisY { get; }
Visual Basic
Public Shared ReadOnly Property BasisY As XYZ
	Get
Visual C++
public:
static property XYZ^ BasisY {
	XYZ^ get ();
}
Remarks
The basis of the Y axis is the vector (0,1,0), the unit vector on the Y axis.
See Also
XYZ Class
Autodesk.Revit.DB Namespace